# Optional Exercise - Data loading

Heres a very short example for four files to load in. None of these example should be hard, but the idea is to familiarise yourself with the sorts of error messages or weird output you'd get if you load in with the defaults (and they don't work), and then how to change your input arguments to make it better.

The files to attempt to load in are:

1. example.pkl
2. example_1.csv
3. example_2.csv
3. example_3.csv
3. example_4.csv

In [1]:
import pandas as pd

In [4]:
df1 = pd.read_pickle('example.pkl')
df1.head()

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN

In [5]:
df2 = pd.read_csv('example_1.csv')
df2.head()

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN

In [13]:
df3 = pd.read_csv('example_2.csv', sep='\t')
df3.head()

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN

In [29]:
df3 = pd.read_csv('example_2.csv', delim_whitespace=True)
df3.head()

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN

In [30]:
df4 = pd.read_csv('example_3.csv', index_col=0)
df4

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN
5  Jashnah  Female  34.0    3.0

In [34]:
pd.read_csv('example_4.csv', sep='|', skiprows=1, comment='#')

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN
5  Jashnah  Female  34.0    3.0

In [28]:
? pd.read_csv